[
  {
    "id": "reykjavik",
    "name": "Reykjavik",
    "country": "Iceland",
    "connectionType": "direct",
    "flightTime": "7 hr 35 min",
    "route": "PDX -> KEF",
    "description": "Reykjavik's downtown is compact, colorful, and feels more like a large coastal town than a sprawling European capital.",
    "dayTrips": [
      {
        "title": "The Golden Circle",
        "description": "A classic route via scheduled coach featuring highly accessible, flat walking paths right between tectonic plates at Thingvellir National Park."
      },
      {
        "title": "The South Coast",
        "description": "A scheduled coach heads down to dramatic black sand beaches and towering waterfalls like Seljalandsfoss, which has a path allowing you to walk behind the falling water."
      },
      {
        "title": "Reykjadalur Thermal River",
        "description": "Accessible via local public bus (Route 51). Involves a moderate hike up a beautiful valley past steam vents, ending at a naturally heated river."
      }
    ],
    "extendedDetails": {
      "gettingAround": {
        "text": "Completely car-free. We will rely on the highly walkable downtown, the yellow public bus system (*Strætó*) for town-to-town travel, and comfortable, scheduled tourist coaches for reaching the major natural landmarks and trailheads.",
        "note": "There are absolutely no public trains in Iceland!"
      },
      "primaryDestination": {
        "title": "Exploring the Primary Destination: Reykjavik",
        "items": [
          {
            "title": "City Walking & Culture",
            "description": "Wander around Tjörnin (the central city pond). The city has a phenomenal baking culture, so grab fresh sourdough or massive cinnamon rolls (snúður) while exploring local record shops and acoustic music venues."
          },
          {
            "title": "Public Pools",
            "description": "Locals gather at public geothermal pools like Laugardalslaug, accessible by local bus and featuring massive, warm outdoor hot tubs and water slides."
          },
          {
            "title": "The Obscure Explorer Sites",
            "description": "Visit the Gossip Ledge (Kjaftasker) at the corner of Skólavörðustígur and Bergstaðastræti—the historic, physical communication network of the city before modern pools existed. Then, view the excavated Viking-age ruins beneath Aðalstræti 10, the city's oldest timber house."
          }
        ]
      },
      "attractions": {
        "title": "The Important Tourist Attractions",
        "items": [
          {
            "title": "The Blue Lagoon & Sky Lagoon",
            "description": "Massive, commercialized geothermal spas offering a luxurious soaking experience (requires booking well in advance)."
          },
          {
            "title": "Hallgrímskirkja",
            "description": "The iconic, towering concrete church. Tourists flock here for panoramic views of the city."
          },
          {
            "title": "Perlan (Wonders of Iceland)",
            "description": "A glass-domed interactive museum with a planetarium and a man-made indoor ice cave."
          }
        ]
      },
      "food": {
        "title": "Local Food & Dining",
        "items": [
          {
            "title": "Grocery Stores (Bónus and Krónan)",
            "description": "Stock up on **Skyr** (dense, protein-rich cultured dairy), **Harðfiskur** (dried fish jerky), fresh greenhouse-grown tomatoes/cucumbers, and **Rúgbrauð** (dense geothermal rye bread)."
          },
          {
            "title": "Casual & Street Food",
            "description": "The **Icelandic Hot Dog** (*pylsa*) made of free-range lamb with all the toppings. **Kjötsúpa** (traditional lamb and root vegetable meat soup) is perfect after a hike."
          },
          {
            "title": "Restaurants",
            "description": "Expect incredibly fresh seafood like pan-fried Arctic char and Atlantic cod. A classic comfort dish is **Plokkfiskur**, a creamy fish and potato stew."
          }
        ]
      },
      "itinerary": {
        "title": "10-Day Itinerary",
        "items": [
          { "day": "Day 1", "activity": "Afternoon non-stop flight out of PDX." },
          { "day": "Day 2", "activity": "Arrive at KEF. Board the Flybus into the city. Walk around Tjörnin and grab hot dogs at Bæjarins Beztu Pylsur." },
          { "day": "Day 3", "activity": "Fresh sourdough and pastries. Explore Harpa Concert Hall's interactive acoustic room. Afternoon Strætó bus to Laugardalslaug pool." },
          { "day": "Day 4", "activity": "Scheduled Golden Circle Coach (Thingvellir, Geysir, Gullfoss). Hearty Kjötsúpa for dinner." },
          { "day": "Day 5", "activity": "Grocery run for Skyr and Rúgbrauð. Walk up Hallgrímskirkja and browse local record shops. Cook dinner together." },
          { "day": "Day 6", "activity": "Scheduled South Coast Coach (Seljalandsfoss, Skógafoss, Reynisfjara black sand beach)." },
          { "day": "Day 7", "activity": "Route 51 bus to Hveragerði. Moderate hike to the Reykjadalur thermal river to wade and relax." },
          { "day": "Day 8", "activity": "Whales of Iceland exhibition in the Grandi harbor district. Ice cream and coastal walking." },
          { "day": "Day 9", "activity": "Bus to Perlan to see the indoor ice cave. Souvenir shopping and a celebratory final dinner." },
          { "day": "Day 10", "activity": "Flybus back to KEF. Non-stop flight home to Portland." }
        ]
      }
    },
    "map": {
      "center": [64.1466, -21.9426],
      "zoom": 8,
      "markers": [
        { "coords": [64.1466, -21.9426], "title": "Reykjavik City Center" },
        { "coords": [64.2556, -21.1296], "title": "Thingvellir National Park (Golden Circle)" },
        { "coords": [64.0226, -21.2116], "title": "Reykjadalur Hot Spring River" },
        { "coords": [63.8804, -22.4495], "title": "Blue Lagoon" },
        { "coords": [64.1417, -21.9266], "title": "Hallgrímskirkja" },
        { "coords": [64.1292, -21.9185], "title": "Perlan" },
        { "coords": [64.3271, -20.1199], "title": "Gullfoss" },
        { "coords": [63.6156, -19.9885], "title": "Seljalandsfoss" },
        { "coords": [63.4036, -19.0470], "title": "Reynisfjara (Black Sand Beach)" }
      ]
    }
  },
  {
    "id": "amsterdam",
    "name": "Amsterdam",
    "country": "Netherlands",
    "connectionType": "direct",
    "flightTime": "9 hr 35 min",
    "route": "PDX -> AMS",
    "description": "The city is structured around concentric rings of canals. It’s highly picturesque and visually stunning, but walkers do need to stay alert and stay out of the dedicated bicycle lanes!",
    "dayTripIntro": "The Dutch rail system is phenomenal. You simply tap in at Amsterdam Centraal station and can be in an entirely different landscape in under an hour. These options skip the massive crowds and focus on hands-on exploration, sprawling gardens, and historic food culture.",
    "dayTrips": [
      {
        "title": "Leiden (Botanical Gardens & Quiet Canals)",
        "description": "About 35 minutes by train. Leiden offers the same picturesque, bridge-lined canals as Amsterdam but with a fraction of the tourists. It is home to the Hortus botanicus Leiden, the oldest botanical garden in the Netherlands. You can spend hours walking the massive outdoor beds, historic medicinal herb gardens, and intricate tropical greenhouse complexes."
      },
      {
        "title": "Amersfoort (Medieval Gates & Cobblestones)",
        "description": "About 45 minutes by train. The historic center feels like stepping into a sprawling adventure game. The city is completely encircled by its original medieval walls, and exploring the Koppelpoort—a massive 15th-century combined land and water gate—offers a fantastic labyrinth of cobblestones, bridges, and defensive towers to walk through."
      },
      {
        "title": "Haarlem & Zuid-Kennemerland National Park",
        "description": "Just 15 minutes by train. Haarlem itself is a stunning historic city with a phenomenal local baking and cafe scene. From the station, you have immediate access to Zuid-Kennemerland National Park. It features miles of wide, sandy trails winding through forested coastal dunes, where you can frequently spot free-roaming Highland cattle and wild horses."
      },
      {
        "title": "Gouda (Syrup Waffles & Market Squares)",
        "description": "About 55 minutes by train. While famous for its cheese market, Gouda is also the historic birthplace of the Stroopwafel. Walking the historic center means following the scent of warm caramel and baking dough to find traditional bakeries making them fresh from the iron. The central market square is massive and highly walkable, anchored by a stunning 15th-century Gothic town hall."
      },
      {
        "title": "Arnhem (Open-Air History & Forest Trails)",
        "description": "About 1 hour and 15 minutes by train. Arnhem is the gateway to the Nederlands Openluchtmuseum (Netherlands Open Air Museum). It is a sprawling forested park where dozens of historic Dutch windmills, farmhouses, and workshops have been meticulously relocated and reconstructed. It is entirely hands-on, featuring live demonstrations of traditional bread baking, brewing, and historic crafts."
      },
      {
        "title": "Utrecht (Museum Speelklok & Sunken Canals)",
        "description": "About 25 minutes by train. Utrecht is defined by its unique bi-level canals, where you can walk down at the water's edge right past historic cellar doors. The star is Museum Speelklok—a highly interactive museum dedicated entirely to self-playing musical instruments. It's fascinating for anyone who appreciates acoustics or plays string and traditional instruments, featuring everything from intricate tiny music boxes to massive, booming street organs."
      },
      {
        "title": "Zandvoort aan Zee (The Coastal Escape)",
        "description": "A 30-minute direct train drops you right at the North Sea coast. It features massive, wide sandy beaches and paved paths weaving through protected coastal dunes, offering a breezy, relaxed change of pace from the city streets."
      }
    ],
    "extendedDetails": {
      "gettingAround": {
        "text": "A masterclass in public transit. The flat landscape is incredibly walkable, but you'll rely heavily on the city's iconic blue-and-white GVB trams and the highly efficient Dutch intercity trains (NS) for day trips."
      },
      "primaryDestination": {
        "title": "Exploring the Primary Destination: Amsterdam",
        "items": [
          {
            "title": "City Walking & Green Spaces",
            "description": "The Jordaan district is the quintessential walking neighborhood, packed with narrow streets and cozy cafes. For a break from the pavement, Vondelpark is a massive, lush oasis right in the city center. The Hortus Botanicus is also centrally located and one of the oldest botanical gardens in the world, featuring spectacular greenhouses and outdoor beds."
          },
          {
            "title": "Tram Cruising",
            "description": "Taking the tram is an activity in itself. It’s a fantastic way to rest tired legs while still getting a ground-level view of the historic architecture passing by."
          },
          {
            "title": "Canal Boats",
            "description": "Viewing the city from the water is entirely different than from the street. Taking an open-air, smaller electric boat tour through the historic rings offers a very relaxed, unique perspective."
          }
        ]
      },
      "attractions": {
        "title": "The Important Tourist Attractions",
        "items": [
          {
            "title": "The Rijksmuseum & Van Gogh Museum",
            "description": "Located right next to each other on Museumplein, these house the country's most famous artistic masterpieces."
          },
          {
            "title": "The Anne Frank House",
            "description": "A profound and sobering historical site. Tickets are notoriously difficult to get and sell out almost instantly when released."
          },
          {
            "title": "The Heineken Experience",
            "description": "A massive, highly commercialized brewery tour that draws huge crowds."
          }
        ]
      },
      "food": {
        "title": "Local Food & Dining",
        "items": [
          {
            "title": "Bakeries & Sweets",
            "description": "The Dutch excel at baked goods. Look for **Stroopwafels** (thin waffle cookies joined by caramel, best eaten warm from a street vendor) and thick slices of **Appeltaart** (Dutch apple pie) at local cafes."
          },
          {
            "title": "Pannenkoeken",
            "description": "Dutch pancakes are large, thin, and can be ordered sweet (with apples and syrup) or savory (with cheese and vegetables). They are a universally beloved meal and a guaranteed hit."
          },
          {
            "title": "Surinamese & Indonesian Food",
            "description": "Due to its colonial history, Amsterdam has world-class Indonesian and Surinamese food. Indonesian *Rijsttafel* (a massive spread of dozens of small vegetable and protein dishes) is a fantastic, shared dining experience."
          },
          {
            "title": "Cheese & Markets",
            "description": "Visit local markets (like the Albert Cuyp Market) for incredible fresh produce, wheels of Gouda, and **Vlaamse Frites** (thick-cut fries served in a paper cone, usually smothered in mayonnaise or peanut sauce)."
          }
        ]
      },
      "itinerary": {
        "title": "10-Day Itinerary",
        "items": [
          { "day": "Day 1", "activity": "Departure: Afternoon non-stop flight out of PDX." },
          { "day": "Day 2", "activity": "Arrival & The Jordaan: Arrive at AMS. The airport has a train station directly underneath it—hop on a train to Amsterdam Centraal (about 15 minutes). Check in and stretch your legs with an easy walk through the picturesque Jordaan district. Keep it relaxed with a casual dinner of sweet or savory *Pannenkoeken*." },
          { "day": "Day 3", "activity": "Puzzles & Parks: Take the tram to the NEMO Science Museum, packed with hands-on, interactive logic puzzles and physics experiments. Head to Vondelpark in the afternoon for massive, car-free walking paths." },
          { "day": "Day 4", "activity": "Musical Instruments in Utrecht: Take a quick 25-minute intercity train south to Utrecht. Walk from the station to Museum Speelklok to see fascinating self-playing musical instruments. Have dinner along Utrecht's unique sunken canals before heading back." },
          { "day": "Day 5", "activity": "Markets & Botanical Gardens: Visit the Albert Cuyp Market in De Pijp for fresh regional produce, local cheeses, and a warm Stroopwafel. Spend the afternoon at the Hortus Botanicus exploring the spectacular climate-controlled greenhouses." },
          { "day": "Day 6", "activity": "Coastal Dunes at Zandvoort: Take the 30-minute direct train to Zandvoort aan Zee. Spend the day walking the wide, sandy beaches and the paved trails that weave through the protected coastal dunes." },
          { "day": "Day 7", "activity": "Windmills & Baking History: Take a quick 20-minute train north to Zaanse Schans. Explore the reconstructed historic village, walk right up to functioning waterfront windmills, and watch live demonstrations of local cheese making and traditional Dutch baking." },
          { "day": "Day 8", "activity": "Classic Art & Canal Cruising: If you booked time slots in advance, spend the morning at the Rijksmuseum or the Van Gogh Museum on Museumplein. Rest your feet in the afternoon by taking a guided, open-air electric boat tour through the historic canal rings." },
          { "day": "Day 9", "activity": "Final Explorations: Have a slow morning revisiting a favorite bakery for pastries or grabbing a coffee along the canals. Spend the afternoon picking up last-minute souvenirs or wandering through a street market." },
          { "day": "Day 10", "activity": "Return Home: Catch the short train from Amsterdam Centraal back to Schiphol Airport (AMS). Board your non-stop flight back to Portland." }
        ]
      }
    },
    "map": {
      "center": [52.3676, 4.9041],
      "zoom": 10,
      "markers": [
        { "coords": [52.3580, 4.8686], "title": "Amsterdam City Center (Vondelpark)" },
        { "coords": [52.3758, 4.5314], "title": "Zandvoort aan Zee" },
        { "coords": [52.4739, 4.8164], "title": "Zaanse Schans" },
        { "coords": [52.0903, 5.1189], "title": "Utrecht (Museum Speelklok)" },
        { "coords": [52.3752, 4.8840], "title": "Anne Frank House" },
        { "coords": [52.3600, 4.8852], "title": "Rijksmuseum & Van Gogh Museum" }
      ]
    }
  },
  {
    "id": "frankfurt",
    "name": "Frankfurt",
    "country": "Germany",
    "connectionType": "direct",
    "flightTime": "10 hr 20 min",
    "route": "PDX -> FRA",
    "description": "Frankfurt offers a striking contrast between a modern, glassy skyline and meticulously reconstructed historic architecture. The city's core is very flat and pedestrian-friendly.",
    "dayTripIntro": "Frankfurt's central train station is one of the most connected hubs in Europe. By hopping on a regional DB train or the local S-Bahn, you can leave the skyscrapers behind and step directly into dense forests, fairy-tale villages, and historic baking towns.",
    "dayTrips": [
      {
        "title": "Limburg an der Lahn (Timber Houses & Bread)",
        "description": "About 1 hour by train. This town is stunningly preserved, featuring some of the oldest half-timbered houses in Germany.  The narrow alleys feel like a maze winding up to the striking St. George's Cathedral. It is a fantastic place to seek out traditional bakeries for dense German bread and massive warm pretzels."
      },
      {
        "title": "Marburg (Cobblestones & Botanical Gardens)",
        "description": "About 1 hour by train. A historic university town built into a steep hillside, crowned by an imposing castle (Landgrafenschloss). It is where the Brothers Grimm studied, and walking the twisting, car-free streets feels entirely like a fairy tale. It is also home to the Alter Botanischer Garten, a beautiful, quiet historic garden right in the city center."
      },
      {
        "title": "Eltville am Rhein (Wine, Roses & Printing Presses)",
        "description": "About 50 minutes by train. Known as the City of Wine and Roses, this is a much quieter, highly walkable alternative to the busy Rhine towns. You can stroll the flat, scenic river promenade and visit the Electoral Castle (Kurfürstliche Burg), which features massive rose gardens and a historical exhibit dedicated to Johannes Gutenberg's early printing presses."
      },
      {
        "title": "Kronberg im Taunus (Castle Ruins & Forest Walks)",
        "description": "Just 20 minutes away on the local S-Bahn. Kronberg is a quiet enclave right at the base of the Taunus mountains. It features a fantastic ruined castle (Burg Kronberg) with towers and battlements you can climb around, and the town is bordered by massive chestnut forests offering miles of easy, shaded walking trails."
      },
      {
        "title": "Michelstadt (Deep Forest History)",
        "description": "About 1 hour and 15 minutes by train. Located deep in the lush Odenwald forest, Michelstadt features one of the most unique, photographed medieval town halls in the country—built entirely on massive wooden stilts. The twisting, car-free alleys are perfect for exploring, with easy access to the surrounding nature park trails."
      }
    ],
    "extendedDetails": {
      "gettingAround": {
        "text": "Highly efficient and fully connected. You'll use the U-Bahn (subway) and S-Bahn (light rail) to zip around the city, and the excellent regional Deutsche Bahn (DB) trains for venturing out to the forests and river valleys."
      },
      "primaryDestination": {
        "title": "Exploring the Primary Destination: Frankfurt",
        "items": [
          {
            "title": "City Walking & Green Spaces",
            "description": "A perfect walk starts at the Römerberg (the historic old town square) and crosses the Eiserner Steg (Iron Footbridge). This puts you right on the Main River promenade—a wide, flat, tree-lined path perfect for a scenic stroll. For a break from the city, the Palmengarten is a spectacular 50-acre botanical garden right in town."
          },
          {
            "title": "The Kleinmarkthalle",
            "description": "A massive indoor food market. It is a fantastic place to wander, packed with fresh regional produce, international ingredients, and local food stalls."
          },
          {
            "title": "Sachsenhausen",
            "description": "Just across the river, this district is famous for its cozy, traditional taverns. It's a great area to explore on foot and often hosts live acoustic and traditional string music in the evenings."
          }
        ]
      },
      "attractions": {
        "title": "The Important Tourist Attractions",
        "items": [
          {
            "title": "Senckenberg Natural History Museum",
            "description": "One of the largest natural history museums in Germany, famous for its massive dinosaur skeletons and extensive fossil collection."
          },
          {
            "title": "The Main Tower",
            "description": "An iconic skyscraper where visitors can take a high-speed glass elevator to an open-air observation deck for panoramic views of the skyline."
          },
          {
            "title": "Goethe House",
            "description": "The historic family home of Germany's most famous writer, meticulously restored to show what life looked like in the 18th century."
          }
        ]
      },
      "food": {
        "title": "Local Food & Dining",
        "items": [
          {
            "title": "Bakeries & Bread",
            "description": "You will find a bakery on almost every corner. Staples include massive, warm soft pretzels (*Laugenbrezel*) and incredible pastries like *Apfelstrudel* (apple strudel) with vanilla sauce."
          },
          {
            "title": "Traditional Dishes",
            "description": "Frankfurt is famous for *Grüne Soße* (Green Sauce), a cold, creamy sauce made from seven fresh regional herbs, typically served over hard-boiled eggs and boiled potatoes. It is light, fresh, and universally loved."
          },
          {
            "title": "Street Food",
            "description": "Bratwurst stalls are everywhere, offering grilled sausages tucked into fresh, crusty rolls with local mustard. Schnitzel (breaded, pan-fried cutlets) is also a menu staple."
          },
          {
            "title": "Beverages",
            "description": "The regional specialty is *Apfelwein* (a tart apple cider). It's typically served in traditional diamond-patterned glasses. A sweeter, highly popular version is *Süßgespritzter* (mixed with sweet lemonade), and local, unfiltered apple juice (*Naturtrüber Apfelsaft*) is widely available."
          }
        ]
      },
      "itinerary": {
        "title": "10-Day Itinerary",
        "items": [
          { "day": "Day 1", "activity": "Departure: Afternoon non-stop flight out of PDX." },
          { "day": "Day 2", "activity": "Arrival & River Walks: Arrive at FRA. Take the S-Bahn directly from the airport into the city center (about 15 minutes). Check in, then stretch your legs by walking across the Eiserner Steg footbridge and strolling down the Main River promenade. Grab a casual dinner of pretzels and bratwurst." },
          { "day": "Day 3", "activity": "Old Town & Markets: Walk the cobblestones of the Römerberg. Head to the Kleinmarkthalle to browse the fresh produce and pick up traditional baked goods for lunch. Spend the afternoon exploring the lush grounds of the Palmengarten." },
          { "day": "Day 4", "activity": "The Rhine Valley: Take a regional train west to the Rhine River. Hop on a riverboat cruise to view the hillside castles, then take an easy hike up the valley trails to explore one of the ruins up close." },
          { "day": "Day 5", "activity": "Dinosaurs & Acoustic Evenings: Spend the morning at the Senckenberg Natural History Museum walking among the massive dinosaur skeletons. In the evening, head across the river to the Sachsenhausen district for a traditional dinner, keeping an ear out for local acoustic or folk music at the taverns." },
          { "day": "Day 6", "activity": "Roman Forts & Forest Trails: Take the train north to the Taunus Nature Park. Spend the day walking the shaded forest trails and exploring the ancient reconstructed Roman fort at Saalburg." },
          { "day": "Day 7", "activity": "Timber Houses at Hessenpark: Take a short transit ride to the Hessenpark Open-Air Museum. Spend the day wandering through the reconstructed historic villages and watching the traditional baking and craftsmanship demonstrations." },
          { "day": "Day 8", "activity": "Heidelberg Castle: Take a direct train south (about an hour) to the historic town of Heidelberg. Walk the beautiful pedestrian streets and take the funicular railway up the mountain to explore the massive, sprawling castle ruins." },
          { "day": "Day 9", "activity": "Final Explorations: Have a slow morning grabbing coffee and an Apfelstrudel. Spend the afternoon picking up last-minute souvenirs along the Zeil pedestrian promenade or visiting the top of the Main Tower. Enjoy a celebratory final dinner featuring Schnitzel and Grüne Soße." },
          { "day": "Day 10", "activity": "Return Home: Take the S-Bahn back to Frankfurt Airport (FRA). Board your non-stop flight back to Portland." }
        ]
      }
    },
    "map": {
      "center": [50.1109, 8.6821],
      "zoom": 9,
      "markers": [
        { "coords": [50.1104, 8.6821], "title": "Frankfurt (Römerberg)" },
        { "coords": [49.9760, 7.9130], "title": "The Rhine Valley (Bingen / Rüdesheim)" },
        { "coords": [50.2709, 8.5670], "title": "Taunus Nature Park (Saalburg)" },
        { "coords": [50.2758, 8.5247], "title": "Hessenpark Open-Air Museum" },
        { "coords": [49.4106, 8.7153], "title": "Heidelberg Castle" },
        { "coords": [50.1175, 8.6517], "title": "Senckenberg Natural History Museum" },
        { "coords": [50.1125, 8.6721], "title": "Main Tower" },
        { "coords": [50.1232, 8.6585], "title": "Palmengarten" }
      ]
    }
  },
  {
    "id": "brussels",
    "name": "Brussels & Antwerp",
    "country": "Belgium",
    "connectionType": "1-stop",
    "flightTime": "~11 to 12 hours total",
    "route": "PDX -> BRU",
    "description": "Brussels offers a highly connected network of trams and metros. Stepping just outside the main tourist squares reveals incredibly vibrant, walkable neighborhoods and specialized museums.",
    "dayTrips": [
      {
        "title": "Leuven (Secret Gardens & Cobblestones)",
        "description": "About 25 minutes by train. A historic university town with a vibrant, lived-in energy. The absolute highlight for walking is the *Groot Begijnhof* (Grand Beguinage), a car-free, hidden village of historic red-brick houses and quiet cobbled streets. It is also home to the *Kruidtuin*, the oldest botanical garden in Belgium, featuring a beautiful tropical greenhouse complex and massive outdoor beds."
      },
      {
        "title": "Mechelen (City of Bells & Games)",
        "description": "A quick 25-minute train north. Mechelen is incredibly walkable and famous as the home of the Royal Carillon School—you can frequently hear the massive acoustic bells echoing from the cathedral as you explore. It also houses the *Speelgoedmuseum* (Toy Museum), a massive, hands-on space packed with wooden logic puzzles, historic games, and interactive challenges."
      },
      {
        "title": "Dinant (Cliffs & Acoustic History)",
        "description": "About 1 hour and 15 minutes by direct train. The landscape changes dramatically as Dinant is squeezed between the Meuse River and towering, sheer rock cliffs. It is the birthplace of the inventor of the saxophone, and the town fully embraces this acoustic history with an interactive museum and giant saxophone sculptures lining the river bridge."
      },
      {
        "title": "Villers-la-Ville (The Ruined Abbey)",
        "description": "About 1 hour and 15 minutes south (usually requiring one quick train change). This is pure exploration: wandering the massive, sprawling stone ruins of a 12th-century abbey. The roof is completely gone and nature has reclaimed the site, with trees growing right through towering Gothic arches and restored medicinal herb gardens to explore at your own pace."
      },
      {
        "title": "Bokrijk (Open-Air History & Forest Trails)",
        "description": "About 1 hour and 30 minutes away (the train drops you right at the \"Bokrijk\" station). This is a massive open-air museum set inside a sprawling forested nature reserve. You can walk through over 100 reconstructed historic windmills and farmhouses, watching live demonstrations of traditional bread baking in wood-fired ovens."
      },
      {
        "title": "Antwerp (Middelheim & Printing Presses)",
        "description": "Just 45 minutes by train. Head to the Plantin-Moretus Museum—the only museum in the world recognized as a UNESCO World Heritage site, featuring the world's oldest printing presses in a stunning 16th-century mansion that feels like a historic puzzle to navigate. Later, walk the Middelheim Open Air Sculpture Museum, a massive park where art is hidden among the walking trails."
      },
      {
        "title": "Ghent (Gravensteen Castle)",
        "description": "About 35 minutes by train. Ghent offers the same stunning canals and medieval architecture as Bruges, but with a more authentic, lived-in feel and far fewer tourists. Exploring the winding staircases, battlements, and armories of Gravensteen (Castle of the Counts) right in the center of the city feels like stepping into a sprawling adventure game."
      }
    ],
    "extendedDetails": {
      "gettingAround": {
        "text": "Completely car-free. Belgium has one of the densest, most efficient railway networks in the world (SNCB). You can base yourself in Brussels and reach almost any city in the country by train in under an hour. Locally, Brussels uses a highly connected network of trams and metros."
      },
      "primaryDestination": {
        "title": "Exploring the Primary Destination: Brussels",
        "items": [
          {
            "title": "Musical Instruments Museum (MIM)",
            "description": "Housed in a spectacular Art Nouveau building, this museum is an absolute must-visit. It features thousands of instruments from around the world. You are given headphones that automatically play the music of the specific acoustic, string, or traditional instrument you are standing in front of as you walk through the exhibits."
          },
          {
            "title": "Les Marolles & The Sablon",
            "description": "Skip the crowded shopping streets and walk through Les Marolles, a historic, working-class neighborhood famous for its massive daily flea market at Place du Jeu de Balle. It seamlessly borders the Sablon district, known for its incredible architecture and artisan chocolate shops."
          },
          {
            "title": "Meise Botanic Garden",
            "description": "Located just a short bus ride from the city center, this is one of the largest botanical gardens in the world. It offers massive outdoor walking grounds and interconnected, climate-controlled greenhouses that are incredibly peaceful to explore."
          }
        ]
      },
      "attractions": {
        "title": "The \"In the Know\" Tourist Attractions",
        "items": [
          {
            "title": "Bruges",
            "description": "Often called the \"Venice of the North.\" It is undeniably beautiful, but it is heavily touristed and can feel more like a museum than a functioning city during the summer peak."
          },
          {
            "title": "The Grand Place",
            "description": "The central square of Brussels, surrounded by opulent guildhalls. It is breathtaking to walk through once, but the surrounding streets are packed with tourist-trap restaurants."
          },
          {
            "title": "The Atomium & Mini-Europe",
            "description": "Built for the 1958 World's Fair, this giant stainless steel atom offers panoramic views, with a park of miniature European landmarks sitting at its base."
          }
        ]
      },
      "food": {
        "title": "Local Food & Dining",
        "items": [
          {
            "title": "The Waffles",
            "description": "There are two main types. The **Brussels Waffle** is rectangular, light, and crispy (usually eaten sitting down with toppings). The **Liège Waffle** is dense, chewy, and packed with pearl sugar that caramelizes on the iron (best eaten warm from a street vendor while walking)."
          },
          {
            "title": "Frietkot Culture",
            "description": "Belgian fries (*frieten*) are a cultural institution. They are thick-cut, double-fried, and served in a paper cone from dedicated kiosks (*frietkots*). They are traditionally eaten with mayonnaise or specialized sauces like Andalouse."
          },
          {
            "title": "Bakeries & Breads",
            "description": "The baking scene is phenomenal. Look for *Cramique* (a soft brioche loaf baked with raisins) or *Craquelin* (baked with sugar nibs) for breakfast."
          },
          {
            "title": "Chocolate",
            "description": "Skip the massive international brands and look for independent *chocolatiers* in the Sablon district making fresh pralines (chocolate shells filled with soft centers)."
          }
        ]
      },
      "itinerary": {
        "title": "10-Day Itinerary",
        "items": [
          { "day": "Day 1", "activity": "Departure: Afternoon flight out of PDX, connecting through a European hub." },
          { "day": "Day 2", "activity": "Arrival & Les Marolles: Arrive at BRU. Take the 20-minute train directly into Brussels Central. Check in and stretch your legs by walking the historic streets of Les Marolles. Grab a warm Liège waffle from a street vendor to help combat the jet lag." },
          { "day": "Day 3", "activity": "Instruments & Greenhouses: Spend the morning exploring the incredible acoustic and traditional exhibits at the Musical Instruments Museum (MIM). In the afternoon, take a short ride out to the Meise Botanic Garden to walk the expansive grounds and greenhouses." },
          { "day": "Day 4", "activity": "Antwerp's Historic Puzzles: Take the 45-minute train north to Antwerp. Spend the morning exploring the labyrinthine rooms and ancient presses of the Plantin-Moretus Museum." },
          { "day": "Day 5", "activity": "Antwerp's Outdoor Trails: Return to Antwerp or stay overnight. Spend the day walking the expansive, shaded trails of the Middelheim Open Air Sculpture Museum, grabbing thick-cut *frieten* from a local *frietkot* for lunch." },
          { "day": "Day 6", "activity": "Medieval Ghent: Take the 35-minute train to Ghent. Spend the day exploring the winding stone corridors and towers of Gravensteen Castle. Walk the picturesque Graslei harbor and seek out a local bakery for fresh *Cramique*." },
          { "day": "Day 7", "activity": "Brussels City Walking: Have a slow morning in Brussels. Walk through the stunning Sablon district, stopping into independent chocolatiers to assemble a box of fresh pralines. Enjoy a relaxed, sit-down lunch of traditional Flemish stew (*Carbonnade Flamande*)." },
          { "day": "Day 8", "activity": "Flexible Exploration: Keep this day open. Revisit a favorite neighborhood, take a quick train to the university town of Leuven to walk the botanical gardens there, or explore the massive Parc du Cinquantenaire." },
          { "day": "Day 9", "activity": "Final Explorations: Pick up any last-minute souvenirs or specialized local baking tools. Enjoy a celebratory final dinner out in the city." },
          { "day": "Day 10", "activity": "Return Home: Take the short train back to Brussels Airport (BRU). Board your flight back to the US, clearing customs comfortably back in Portland." }
        ]
      }
    },
    "map": {
      "center": [50.8503, 4.3517],
      "zoom": 9,
      "markers": [
        { "coords": [50.8428, 4.3585], "title": "Brussels (MIM/Center)" },
        { "coords": [50.9284, 4.3274], "title": "Meise Botanic Garden" },
        { "coords": [50.8798, 4.7005], "title": "Leuven" },
        { "coords": [51.0259, 4.4776], "title": "Mechelen" },
        { "coords": [50.2600, 4.9120], "title": "Dinant" },
        { "coords": [50.5906, 4.5297], "title": "Villers-la-Ville" },
        { "coords": [50.9575, 5.4087], "title": "Bokrijk" },
        { "coords": [51.2194, 4.4025], "title": "Antwerp" },
        { "coords": [51.0543, 3.7174], "title": "Ghent" }
      ]
    }
  }
]
